# Task 1

In [20]:
import sqlite3

In [23]:
conn = sqlite3.connect('detilar.db')
cursor = conn.cursor()

In [25]:
cursor.execute('''
    CREATE TABLE Children (
        Child_ID INTEGER PRIMARY KEY,
        Name TEXT,
        Age INTEGER,
        Parent_ID INTEGER
    )
''')

In [27]:
cursor.execute('''
    CREATE TABLE Parents (
        Parent_ID INTEGER PRIMARY KEY,
        Parent_Name TEXT,
        Phone TEXT,
        Email TEXT
    )
''')

In [ ]:
cursor.execute('''
    CREATE TABLE Groups (
        Group_ID INTEGER PRIMARY KEY,
        Group_Name TEXT,
        Teacher_ID INTEGER
    )
''')

In [ ]:
cursor.execute('''
    CREATE TABLE Teachers (
        Teacher_ID INTEGER PRIMARY KEY,
        Teacher_Name TEXT,
        Group_ID INTEGER
    )
''')

In [28]:
# Заполнение таблиц данными
children_data = [
    (1, 'Гульнар', 4, 1),
    (2, 'Ален', 5, 2),
    (3, 'Мадина', 3, 3),
    (4, 'Настя', 4, 1),
    (5, 'Меруерт', 5, 2),
    (6, 'Айтмухаммед', 3, 3),
    (7, 'Сева', 4, 1),
    (8, 'Аят', 5, 2),
    (9, 'Ернияз', 3, 3),
    (10, 'Айымгуль', 4, 1)
]

In [29]:
parents_data = [
    (1, 'Алихан Кенжеев', '+77773456789', 'alikhan_kenzheev@example.com'),
    (2, 'Айнур Мухамеджанов', '+77777654321', 'aynur_mukhamedzhanov@example.com'),
    (3, 'Асем Нургалиева', '+777722334455', 'asem_nurgalieva@example.com'),
    (4, 'Данияр Сейтжанов', '+777788776655', 'danik777@example.com'),
    (5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com'),
    (6, 'Еркежан Темиргалиев', '+777722334455', 'yerkee@example.com'),
    (7, 'Зарина Сапарбаева', '+777722334455', 'zarina_03@example.com'),
    (8, 'Искандер Жумабаев', '+777722334455', 'iskalove@example.com'),
    (9, 'Камила Токтаганова', '+777722334455', 'camatok@example.com'),
    (10, 'Лейла Ислямова', '+777722334455', 'leykaa@example.com')
]

In [30]:
groups_data = [
    (1, 'Малыши', 1),
    (2, 'Старшая группа', 2),
    (3, 'Средняя группа', 3),
    (4, 'Старшая группа', 1),
    (5, 'Малыши', 2),
    (6, 'Средняя группа', 3),
    (7, 'Старшая группа', 1),
    (8, 'Малыши', 2),
    (9, 'Средняя группа', 3),
    (10, 'Малыши', 1)
]

In [31]:
teachers_data = [
    (1, 'Айгерим Абдулова', 1),
    (2, 'Айжан Абдуллаева', 2),
    (3, 'Айнур Абуова', 3),
    (4, 'Айсулу Агеева', 1),
    (5, 'Айым Азимова', 2),
    (6, 'Айгуль Айбулатова', 3),
    (7, 'Амина Айтбаева', 1),
    (8, 'Аружан Акимова', 2),
    (9, 'Асель Актанова', 3),
    (10, 'Дана Аманова', 1)
]

In [32]:
conn = sqlite3.connect('detilar.db')
cursor = conn.cursor()

In [80]:
cursor.executemany('INSERT INTO Children VALUES (?, ?, ?, ?, ?, ?)', children_data)
cursor.executemany('INSERT INTO Parents VALUES (?, ?, ?, ?)', parents_data)
cursor.executemany('INSERT INTO Groups VALUES (?, ?, ?)', groups_data)
cursor.executemany('INSERT INTO Teachers VALUES (?, ?, ?)', teachers_data)

ProgrammingError: Incorrect number of bindings supplied. The current statement uses 6, and there are 4 supplied.

In [34]:
conn.commit()
# conn.close()

# Task 2

In [35]:
# 2 простых запроса к 1 таблице
cursor.execute('SELECT * FROM Children WHERE Age > 4')
print(cursor.fetchall())

[(2, 'Ален', 5, 2), (5, 'Меруерт', 5, 2), (8, 'Аят', 5, 2)]

In [36]:
cursor.execute('SELECT Name, Age FROM Children WHERE Parent_ID = 1')
print(cursor.fetchall())

[('Гульнар', 4), ('Настя', 4), ('Сева', 4), ('Айымгуль', 4)]

In [37]:
# 2 запроса с использованием JOIN к 2 таблицам
cursor.execute('SELECT Children.Name, Parents.Parent_Name FROM Children INNER JOIN Parents ON Children.Parent_ID = Parents.Parent_ID')
print(cursor.fetchall())

[('Гульнар', 'Алихан Кенжеев'), ('Ален', 'Айнур Мухамеджанов'), ('Мадина', 'Асем Нургалиева'), ('Настя', 'Алихан Кенжеев'), ('Меруерт', 'Айнур Мухамеджанов'), ('Айтмухаммед', 'Асем Нургалиева'), ('Сева', 'Алихан Кенжеев'), ('Аят', 'Айнур Мухамеджанов'), ('Ернияз', 'Асем Нургалиева'), ('Айымгуль', 'Алихан Кенжеев')]

In [38]:
cursor.execute('SELECT Teachers.Teacher_Name, Groups.Group_Name FROM Teachers INNER JOIN Groups ON Teachers.Group_ID = Groups.Group_ID')
print(cursor.fetchall())

[('Айгерим Абдулова', 'Малыши'), ('Айжан Абдуллаева', 'Старшая группа'), ('Айнур Абуова', 'Средняя группа'), ('Айсулу Агеева', 'Малыши'), ('Айым Азимова', 'Старшая группа'), ('Айгуль Айбулатова', 'Средняя группа'), ('Амина Айтбаева', 'Малыши'), ('Аружан Акимова', 'Старшая группа'), ('Асель Актанова', 'Средняя группа'), ('Дана Аманова', 'Малыши')]

In [50]:
# 2 запроса с использованием JOIN к 3 таблицам
cursor.execute('SELECT Children.Name, Parents.Parent_Name, Groups.Group_Name FROM Children INNER JOIN Parents ON Children.Parent_ID = Parents.Parent_ID INNER JOIN Groups ON Children.Group_ID = Groups.Group_ID')
print(cursor.fetchall())

[('Гульнар', 'Алихан Кенжеев', 'Малыши'), ('Ален', 'Айнур Мухамеджанов', 'Старшая группа')]

In [49]:
cursor.execute('SELECT Children.Name, Parents.Parent_Name, Teachers.Teacher_Name FROM Children INNER JOIN Parents ON Children.Parent_ID = Parents.Parent_ID INNER JOIN Teachers ON Children.Teacher_ID = Teachers.Teacher_ID')
print(cursor.fetchall())

[('Гульнар', 'Алихан Кенжеев', 'Айгерим Абдулова'), ('Ален', 'Айнур Мухамеджанов', 'Айжан Абдуллаева'), ('Мадина', 'Асем Нургалиева', 'Айнур Абуова'), ('Настя', 'Алихан Кенжеев', 'Айсулу Агеева'), ('Меруерт', 'Айнур Мухамеджанов', 'Айым Азимова'), ('Айтмухаммед', 'Асем Нургалиева', 'Айгуль Айбулатова')]

In [54]:
# 2 запроса с использованием GROUP BY не менее 3 таблиц
cursor.execute('SELECT Group_Name, COUNT(Child_ID) FROM Children, Groups GROUP BY Group_Name')
print(cursor.fetchall())

[('Малыши', 40), ('Средняя группа', 30), ('Старшая группа', 30)]

In [56]:
cursor.execute('SELECT Group_Name, AVG(Age) FROM Children, Groups GROUP BY Group_Name')
print(cursor.fetchall())

[('Малыши', 4.0), ('Средняя группа', 4.0), ('Старшая группа', 4.0)]

In [58]:
# 2 запроса с использованием HAVING не менее 3 таблиц
cursor.execute('SELECT Group_Name, COUNT(Child_ID) FROM Children, Groups GROUP BY Group_Name HAVING COUNT(Child_ID) > 5')
print(cursor.fetchall())

[('Малыши', 40), ('Средняя группа', 30), ('Старшая группа', 30)]

In [59]:
cursor.execute('SELECT Parent_Name, COUNT(Child_ID) FROM Parents INNER JOIN Children ON Parents.Parent_ID = Children.Parent_ID GROUP BY Parent_Name HAVING COUNT(Child_ID) <= 3')
print(cursor.fetchall())

[('Айнур Мухамеджанов', 3), ('Асем Нургалиева', 3)]

In [61]:
# 2 запроса с использованием ORDER BY не менее 2 таблиц
cursor.execute('SELECT * FROM Children ORDER BY Age DESC')
print(cursor.fetchall())

[(2, 'Ален', 5, 2, 2, 2), (5, 'Меруерт', 5, 2, None, 5), (8, 'Аят', 5, 2, None, None), (1, 'Гульнар', 4, 1, 1, 1), (4, 'Настя', 4, 1, None, 4), (7, 'Сева', 4, 1, None, None), (10, 'Айымгуль', 4, 1, None, None), (3, 'Мадина', 3, 3, None, 3), (6, 'Айтмухаммед', 3, 3, None, 6), (9, 'Ернияз', 3, 3, None, None)]

In [62]:
cursor.execute('SELECT * FROM Parents ORDER BY Parent_Name ASC')
print(cursor.fetchall())

[(2, 'Айнур Мухамеджанов', '+77777654321', 'aynur_mukhamedzhanov@example.com'), (1, 'Алихан Кенжеев', '+77773456789', 'alikhan_kenzheev@example.com'), (3, 'Асем Нургалиева', '+777722334455', 'asem_nurgalieva@example.com'), (5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com'), (4, 'Данияр Сейтжанов', '+777788776655', 'danik777@example.com'), (6, 'Еркежан Темиргалиев', '+777722334455', 'yerkee@example.com'), (7, 'Зарина Сапарбаева', '+777722334455', 'zarina_03@example.com'), (8, 'Искандер Жумабаев', '+777722334455', 'iskalove@example.com'), (9, 'Камила Токтаганова', '+777722334455', 'camatok@example.com'), (10, 'Лейла Ислямова', '+777722334455', 'leykaa@example.com')]

In [63]:
# 2 запроса с предикатами сравнения
cursor.execute('SELECT * FROM Children WHERE Age >= 4')
print(cursor.fetchall())

[(1, 'Гульнар', 4, 1, 1, 1), (2, 'Ален', 5, 2, 2, 2), (4, 'Настя', 4, 1, None, 4), (5, 'Меруерт', 5, 2, None, 5), (7, 'Сева', 4, 1, None, None), (8, 'Аят', 5, 2, None, None), (10, 'Айымгуль', 4, 1, None, None)]

In [64]:
cursor.execute('SELECT * FROM Parents WHERE Phone <> "+123456789"')
print(cursor.fetchall())

[(1, 'Алихан Кенжеев', '+77773456789', 'alikhan_kenzheev@example.com'), (2, 'Айнур Мухамеджанов', '+77777654321', 'aynur_mukhamedzhanov@example.com'), (3, 'Асем Нургалиева', '+777722334455', 'asem_nurgalieva@example.com'), (4, 'Данияр Сейтжанов', '+777788776655', 'danik777@example.com'), (5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com'), (6, 'Еркежан Темиргалиев', '+777722334455', 'yerkee@example.com'), (7, 'Зарина Сапарбаева', '+777722334455', 'zarina_03@example.com'), (8, 'Искандер Жумабаев', '+777722334455', 'iskalove@example.com'), (9, 'Камила Токтаганова', '+777722334455', 'camatok@example.com'), (10, 'Лейла Ислямова', '+777722334455', 'leykaa@example.com')]

In [65]:
# 2 запроса с предикатами вхождения IN
cursor.execute('SELECT * FROM Children WHERE Age IN (4, 5)')
print(cursor.fetchall())

[(1, 'Гульнар', 4, 1, 1, 1), (2, 'Ален', 5, 2, 2, 2), (4, 'Настя', 4, 1, None, 4), (5, 'Меруерт', 5, 2, None, 5), (7, 'Сева', 4, 1, None, None), (8, 'Аят', 5, 2, None, None), (10, 'Айымгуль', 4, 1, None, None)]

In [66]:
cursor.execute('SELECT * FROM Parents WHERE Parent_ID IN (1, 3, 5)')
print(cursor.fetchall())

[(1, 'Алихан Кенжеев', '+77773456789', 'alikhan_kenzheev@example.com'), (3, 'Асем Нургалиева', '+777722334455', 'asem_nurgalieva@example.com'), (5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com')]

In [67]:
# 2 запроса с предикатами существования и не существования
cursor.execute('SELECT * FROM Children WHERE EXISTS (SELECT * FROM Groups WHERE Children.Group_ID = Groups.Group_ID)')
print(cursor.fetchall())

[(1, 'Гульнар', 4, 1, 1, 1), (2, 'Ален', 5, 2, 2, 2)]

In [68]:
cursor.execute('SELECT * FROM Parents WHERE NOT EXISTS (SELECT * FROM Children WHERE Parents.Parent_ID = Children.Parent_ID)')
print(cursor.fetchall())

[(4, 'Данияр Сейтжанов', '+777788776655', 'danik777@example.com'), (5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com'), (6, 'Еркежан Темиргалиев', '+777722334455', 'yerkee@example.com'), (7, 'Зарина Сапарбаева', '+777722334455', 'zarina_03@example.com'), (8, 'Искандер Жумабаев', '+777722334455', 'iskalove@example.com'), (9, 'Камила Токтаганова', '+777722334455', 'camatok@example.com'), (10, 'Лейла Ислямова', '+777722334455', 'leykaa@example.com')]

In [69]:
# 2 запроса с агрегатными функциями
cursor.execute('SELECT COUNT(*) FROM Children')
print(cursor.fetchall())

[(10,)]

In [70]:
cursor.execute('SELECT MAX(Age) FROM Children')
print(cursor.fetchall())

[(5,)]

In [71]:
# Удаление записи в таблице по запросу
cursor.execute('DELETE FROM Children WHERE Child_ID = 10')
conn.commit()

In [75]:

cursor.execute('SELECT * FROM Children')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Гульнар', 4, 1, 1, 1)
(2, 'Ален', 5, 2, 2, 2)
(3, 'Мадина', 3, 3, None, 3)
(4, 'Настя', 4, 1, None, 4)
(5, 'Меруерт', 5, 2, None, 5)
(6, 'Айтмухаммед', 3, 3, None, 6)
(7, 'Сева', 4, 1, None, None)
(8, 'Аят', 5, 2, None, None)
(9, 'Ернияз', 3, 3, None, None)

In [76]:
# Изменение записи в таблице по запросу
cursor.execute('UPDATE Parents SET Phone = "+999999999" WHERE Parent_ID = 2')
conn.commit()

In [77]:

cursor.execute('SELECT * FROM Parents')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Алихан Кенжеев', '+77773456789', 'alikhan_kenzheev@example.com')
(2, 'Айнур Мухамеджанов', '+999999999', 'aynur_mukhamedzhanov@example.com')
(3, 'Асем Нургалиева', '+777722334455', 'asem_nurgalieva@example.com')
(4, 'Данияр Сейтжанов', '+777788776655', 'danik777@example.com')
(5, 'Гульназ Абдрахманова', '+777777889900', 'gulya1@example.com')
(6, 'Еркежан Темиргалиев', '+777722334455', 'yerkee@example.com')
(7, 'Зарина Сапарбаева', '+777722334455', 'zarina_03@example.com')
(8, 'Искандер Жумабаев', '+777722334455', 'iskalove@example.com')
(9, 'Камила Токтаганова', '+777722334455', 'camatok@example.com')
(10, 'Лейла Ислямова', '+777722334455', 'leykaa@example.com')